app/views/users/followers.html.erb

					<% if current_user.following?(@user) %>
    					<%= form_for(current_user.active_relationships.find_by(followed_id: @user.id),
             html: { method: :delete },remote: true) do |f| %>
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."follower_id" = ? AND "relationships"."followed_id" = ? LIMIT ?  [["follower_id", 14], ["followed_id", 14], ["LIMIT", 1]]