app/controllers/books_controller.rb

   def new
  	@book = Book.new
  	@books = Book.page(params[:page]).reverse_order
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def create
  	@book = Book.new(book_params)
  	if @book.save
      flash[:notice] = "book was successfully created "
  		redirect_to book_path(@book.id)
  	else
      @books = Book.page(params[:page]).reverse_order
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "afa"], ["body", "afaf"], ["user_id", 9], ["created_at", "2019-07-28 10:53:29.723846"], ["updated_at", "2019-07-28 10:53:29.723846"]]
SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 14], ["OFFSET", 0]]

  def update
    @book = Book.find(params[:id])

    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "afaffafaf"], ["updated_at", "2019-07-28 10:54:45.035050"], ["id", 1]]

  def index
    @book = Book.new
    @user = User.find_by(id: @book.user_id)
    @book_comment = BookComment.new
    @books = Book.all.search(params[:search])
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE (title LIKE '%aa%') AND (user.name LIKE '%aa%')

  def show
  	@book = Book.find(params[:id])
    @user = User.find_by(id: @book.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]