app/controllers/relationships_controller.rb

 def create
    user = User.find(params[:followed_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def destroy
    user = Relationship.find(params[:id]).followed
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]