app/models/user.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 7], ["followed_id", 7], ["created_at", "2019-07-06 03:37:12.000514"], ["updated_at", "2019-07-06 03:37:12.000514"]]
---
   def follow(other_user)
    active_relationships.create(followed_id: other_user.id)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def unfollow(other_user)
    active_relationships.find_by(followed_id: other_user.id).destroy